app/Controllers/Associate.php

    public function dashboard()
    {
        $equipmentModel = new EquipmentModel();
        $transactionModel = new TransactionModel();
        $user_id = session()->get('user_id');

        $data = [
            'title' => 'Associates Dashboard',
            'user' => [
                'name' => session()->get('firstname') . ' ' . session()->get('lastname'),
                'role' => session()->get('role')
            ],
            'availableEquipment' => $equipmentModel->where('is_active', 1)
                                                   ->where('available_quantity >', 0)
                                                   ->orderBy('category', 'ASC')
                                                   ->orderBy('name', 'ASC')
                                                   ->findAll(),
---
SELECT *
FROM `equipment`
WHERE `is_active` = 1
AND `available_quantity` > 0
ORDER BY `category` ASC, `name` ASC

    public function returnEquipment()
    {
        $equipmentModel = new EquipmentModel();
        $transactionModel = new TransactionModel();
        $userModel = new UserModel();

        $transactionId = $this->request->getPost('transaction_id');

        if (!$transactionId) {
            return redirect()->back()->with('error', 'Invalid transaction.');
        }

        $transaction = $transactionModel->find($transactionId);

        if (!$transaction || $transaction['user_id'] != session()->get('user_id')) {
            return redirect()->back()->with('error', 'Transaction not found or unauthorized.');
        }

        if ($transaction['returned'] == 1) {
            return redirect()->back()->with('error', 'Equipment already returned.');
        }

        // Mark as returned
        $transactionModel->update($transactionId, [
            'returned' => 1,
            'return_date' => date('Y-m-d H:i:s')
        ]);

        // Update available quantity
        $equipment = $equipmentModel->find($transaction['equipment_id']);
        $newAvailable = $equipment['available_quantity'] + $transaction['quantity'];
        $equipmentModel->update($transaction['equipment_id'], ['available_quantity' => $newAvailable]);

        // Send return email notification
        $user = $userModel->find(session()->get('user_id'));
---
SELECT *
FROM `equipment`
WHERE `equipment`.`equipment_id` = '7'
UPDATE `equipment` SET `available_quantity` = 11
WHERE `equipment`.`equipment_id` IN ('7')
SELECT *
FROM `users`
WHERE `users`.`user_id` = '3'