app/Controllers/Auth.php

    public function login()
{
    $userModel = new UserModel();

    // Validate form inputs
    $rules = [
        'email'     => 'required|valid_email',
        'password'  => 'required',
    ];

    if (!$this->validate($rules)) {
        return redirect()->back()->with('errors', $this->validator->getErrors())->withInput();
    }

    $email = $this->request->getPost('email');
    $password = $this->request->getPost('password');

    // Find user by email
    $user = $userModel->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'lemeyiv176@httpsu.com'
 LIMIT 1