app/Controllers/Student.php

SELECT *
FROM `equipment`
WHERE `equipment`.`equipment_id` = '14'
---
    public function process()
    {
        $equipment_id = $this->request->getPost('item');
        $qty = max(1, (int)$this->request->getPost('quantity')); // ensure positive int
        $action = $this->request->getPost('action');
        $user_id = session()->get('user_id');

        $equipmentModel = new EquipmentModel();
        $transactionModel = new TransactionModel();

        $equipment = $equipmentModel->find($equipment_id);

UPDATE `equipment` SET `available_quantity` = 17
WHERE `equipment`.`equipment_id` IN ('14')
---
                'created_at' => date('Y-m-d H:i:s')
            ]);

            $equipmentModel->update($equipment_id, [
                'available_quantity' => $equipment['available_quantity'] - $qty
            ]);

SELECT *
FROM `equipment`
WHERE `equipment`.`equipment_id` = '11'
UPDATE `equipment` SET `available_quantity` = 10
WHERE `equipment`.`equipment_id` IN ('11')
---
    public function returnEquipment()
    {
        $equipmentModel = new EquipmentModel();
        $transactionModel = new TransactionModel();

        $transactionId = $this->request->getPost('transaction_id');

        if (!$transactionId) {
            return redirect()->back()->with('error', 'Invalid transaction.');
        }

        $transaction = $transactionModel->find($transactionId);

        if (!$transaction || $transaction['user_id'] != session()->get('user_id')) {
            return redirect()->back()->with('error', 'Transaction not found or unauthorized.');
        }

        if ($transaction['returned'] == 1) {
            return redirect()->back()->with('error', 'Equipment already returned.');
        }

        // Mark as returned
        $transactionModel->update($transactionId, [
            'returned' => 1,
            'return_date' => date('Y-m-d H:i:s')
        ]);

        // Update available quantity
        $equipment = $equipmentModel->find($transaction['equipment_id']);
        $newAvailable = $equipment['available_quantity'] + $transaction['quantity'];
        $equipmentModel->update($transaction['equipment_id'], ['available_quantity' => $newAvailable]);