app/Models/EquipmentModel.php

    public function getAvailableItems()
    {
        return $this->select('equipment.equipment_id, equipment.name, equipment.available_quantity')
            ->where('equipment.available_quantity >', 0)
            ->where('equipment.is_active', 1)
            ->findAll();
---
SELECT `equipment`.`equipment_id`, `equipment`.`name`, `equipment`.`available_quantity`
FROM `equipment`
WHERE `equipment`.`available_quantity` > 0
AND `equipment`.`is_active` = 1