app/Models/TransactionModel.php

    public function getActiveBorrowedItems($user_id)
    {
        return $this->select('borrow_transactions.*, equipment.name, equipment.category, equipment.accessories')
            ->join('equipment', 'equipment.equipment_id = borrow_transactions.equipment_id')
            ->where('borrow_transactions.user_id', $user_id)
            ->where('borrow_transactions.returned', 0)
            ->orderBy('borrow_transactions.borrow_date', 'DESC')
            ->findAll();
---
SELECT `borrow_transactions`.*, `equipment`.`name`, `equipment`.`category`, `equipment`.`accessories`
FROM `borrow_transactions`
JOIN `equipment` ON `equipment`.`equipment_id` = `borrow_transactions`.`equipment_id`
WHERE `borrow_transactions`.`user_id` = '3'
AND `borrow_transactions`.`returned` = 0
ORDER BY `borrow_transactions`.`borrow_date` DESC

    public function getActiveBorrowedItemsPaginated($user_id, $perPage = 8)
    {
        return $this->select('borrow_transactions.*, equipment.name, equipment.category, equipment.accessories')
            ->join('equipment', 'equipment.equipment_id = borrow_transactions.equipment_id')
            ->where('borrow_transactions.user_id', $user_id)
            ->where('borrow_transactions.returned', 0)
            ->orderBy('borrow_transactions.borrow_date', 'DESC')
            ->paginate($perPage);
---
SELECT COUNT(*) AS `numrows`
FROM `borrow_transactions`
JOIN `equipment` ON `equipment`.`equipment_id` = `borrow_transactions`.`equipment_id`
WHERE `borrow_transactions`.`user_id` = '2'
AND `borrow_transactions`.`returned` = 0
SELECT `borrow_transactions`.*, `equipment`.`name`, `equipment`.`category`, `equipment`.`accessories`
FROM `borrow_transactions`
JOIN `equipment` ON `equipment`.`equipment_id` = `borrow_transactions`.`equipment_id`
WHERE `borrow_transactions`.`user_id` = '2'
AND `borrow_transactions`.`returned` = 0
ORDER BY `borrow_transactions`.`borrow_date` DESC
 LIMIT 8